ruuvi/ruuvi.drivers.c/nrf5_sdk15_platform/communication/ruuvi_nrf5_sdk15_communication_ble4_gatt.c
        case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            break;

        default:
            break;
    }
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {

        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {

        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            RUUVI_DRIVER_ERROR_CHECK(ruuvi_nrf5_sdk15_to_ruuvi_error(p_evt->params.peer_data_update_failed.error), RUUVI_DRIVER_SUCCESS);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            RUUVI_DRIVER_ERROR_CHECK(ruuvi_nrf5_sdk15_to_ruuvi_error(p_evt->params.peer_delete_failed.error), RUUVI_DRIVER_SUCCESS);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            RUUVI_DRIVER_ERROR_CHECK(ruuvi_nrf5_sdk15_to_ruuvi_error(p_evt->params.peers_delete_failed_evt.error), RUUVI_DRIVER_SUCCESS);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            RUUVI_DRIVER_ERROR_CHECK(ruuvi_nrf5_sdk15_to_ruuvi_error(p_evt->params.error_unexpected.error), RUUVI_DRIVER_SUCCESS);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}


/**@brief Function for the Peer Manager initialization.
 */
static ret_code_t peer_manager_init()
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code = NRF_SUCCESS;

    err_code |= pm_init();
    if(NRF_SUCCESS != err_code) { }

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    if(NRF_SUCCESS != err_code) { }

    err_code = pm_register(pm_evt_handler);
    if(NRF_SUCCESS != err_code) { }

    return err_code;
}

ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_init(void)
{

  ret_code_t err_code = NRF_SUCCESS;
  ruuvi_driver_status_t radio_status = RUUVI_DRIVER_SUCCESS;

  if (!m_gatt_is_init)
  {
    radio_status = ruuvi_interface_communication_radio_init(RUUVI_INTERFACE_COMMUNICATION_RADIO_GATT);
    if(RUUVI_DRIVER_SUCCESS != radio_status) { return radio_status; }
  }

  // Connection param module requires timers
  if(!ruuvi_interface_timers_is_init())
  {
    ruuvi_interface_log(RUUVI_INTERFACE_LOG_ERROR, "NRF5 SDK15 BLE4 GATT module requires initialized timers\r\n");
    return RUUVI_DRIVER_ERROR_INVALID_STATE;
  }
  nrf_ble_qwr_init_t qwr_init = {0};

  // Register a handler for BLE events.
  NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

  err_code |= peer_manager_init();

  err_code |= gap_params_init();

  err_code |= nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);

  err_code |= nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);

  // Initialize Queued Write Module.
  qwr_init.error_handler = nrf_qwr_error_handler;

  err_code |= nrf_ble_qwr_init(&m_qwr, &qwr_init);

  err_code |= conn_params_init();

  if (NRF_SUCCESS == err_code)
  {
    m_gatt_is_init = true;
  }

  return ruuvi_nrf5_sdk15_to_ruuvi_error(err_code);
}

/**
 *
 */
static ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_nus_uninit(ruuvi_interface_communication_t* const _channel)
{
  if(NULL == _channel) { return RUUVI_DRIVER_ERROR_NULL; }
  memset(_channel, 0, sizeof(ruuvi_interface_communication_t));
  m_gatt_is_init = false;
  // disconnect
  if(BLE_CONN_HANDLE_INVALID != m_conn_handle)
  {
    sd_ble_gap_disconnect(m_conn_handle, HCI_ERROR_CODE_CONN_TERM_BY_LOCAL_HOST);
  }
  // Services cannot be uninitialized
  ruuvi_interface_communication_radio_uninit(RUUVI_INTERFACE_COMMUNICATION_RADIO_GATT);
  return RUUVI_DRIVER_SUCCESS;
}

/**
 *
 */
static ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_nus_send(ruuvi_interface_communication_message_t* const message)
{
  if(NULL == message) { return RUUVI_DRIVER_ERROR_NULL; }
  if(BLE_NUS_MAX_DATA_LEN < message->data_length) { return RUUVI_DRIVER_ERROR_DATA_SIZE; }
  if(BLE_CONN_HANDLE_INVALID == m_conn_handle) { return RUUVI_DRIVER_ERROR_INVALID_STATE; }

  if(message->repeat)
  {
    return RUUVI_DRIVER_ERROR_NOT_IMPLEMENTED;
  }

