ruuvi/ruuvi.drivers.c/nrf5_sdk15_platform/communication/ruuvi_nrf5_sdk15_communication_ble4_gatt.c
  ret_code_t err_code = NRF_SUCCESS;
  uint16_t data_len = message->data_length;
  err_code |= ble_nus_data_send(&m_nus, message->data, &data_len, m_conn_handle);
  return ruuvi_nrf5_sdk15_to_ruuvi_error(err_code);
}

/**
 *
 */
static ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_nus_read(ruuvi_interface_communication_message_t* const message)
{
  return RUUVI_DRIVER_ERROR_NOT_SUPPORTED;
}

ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_nus_init(ruuvi_interface_communication_t* const _channel)
{
  if(NULL == _channel) { return RUUVI_DRIVER_ERROR_NULL; }
  uint32_t           err_code;
  ble_nus_init_t     nus_init;

  // Initialize NUS.
  memset(&nus_init, 0, sizeof(nus_init));
  nus_init.data_handler = nus_data_handler;
  err_code = ble_nus_init(&m_nus, &nus_init);
  channel = _channel;
  channel->init   = ruuvi_interface_communication_ble4_gatt_nus_init;
  channel->uninit = ruuvi_interface_communication_ble4_gatt_nus_uninit;
  channel->send   = ruuvi_interface_communication_ble4_gatt_nus_send;
  channel->read   = ruuvi_interface_communication_ble4_gatt_nus_read;

  m_gatt_is_init = true;
  return ruuvi_nrf5_sdk15_to_ruuvi_error(err_code);
}

bool ble4_nus_is_connected(void)
{
  ret_code_t err_code = NRF_SUCCESS;
  ble_nus_client_context_t * p_client;

  err_code = blcm_link_ctx_get(m_nus.p_link_ctx_storage, m_conn_handle, (void *) &p_client);
  if (NRF_SUCCESS != err_code)
  {
    return false;
  }

  if ((m_conn_handle == BLE_CONN_HANDLE_INVALID) || (p_client == NULL))
  {
    return false;
  }

  if (!p_client->is_notification_enabled)
  {
    return false;
  }
  return true;
}

ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_dfu_init(void)
{

  ret_code_t err_code = NRF_SUCCESS;

    ble_dfu_buttonless_init_t dfus_init = {0};

    // Initialize the async SVCI interface to bootloader.
    err_code = ble_dfu_buttonless_async_svci_init();
    if(NRF_SUCCESS != err_code) {}

    dfus_init.evt_handler = ble_dfu_evt_handler;

    err_code = ble_dfu_buttonless_init(&dfus_init);
    if(NRF_SUCCESS != err_code) {}

  return ruuvi_nrf5_sdk15_to_ruuvi_error(err_code);
}

/**
 * Initialize BLE4 Device firmware update service.
 */
ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_dfu_init();

/**
 * Initialize BLE4 Device Information service
 *
 * parameter dis: pointer to data which should be presented over DIS. Memory will be deep-copied
 */
ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_dis_init(const ruuvi_interface_communication_ble4_gatt_dis_init_t* const dis)
{
  if(NULL == dis) { return RUUVI_DRIVER_ERROR_NULL; }
  ret_code_t err_code = NRF_SUCCESS;
  ble_dis_init_t dis_init;
  memset(&dis_init, 0, sizeof(dis_init));
  ruuvi_interface_communication_ble4_gatt_dis_init_t dis_local;
  memcpy(&dis_local, dis, sizeof(dis_local));
  ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, dis_local.manufacturer);
  ble_srv_ascii_to_utf8(&dis_init.model_num_str, dis_local.model);
  ble_srv_ascii_to_utf8(&dis_init.serial_num_str, dis_local.deviceid);
  ble_srv_ascii_to_utf8(&dis_init.hw_rev_str, dis_local.hw_version);
  ble_srv_ascii_to_utf8(&dis_init.fw_rev_str, dis_local.fw_version);

  // Read security level 1, mode 1. OPEN, i.e. anyone can read without encryption.
  // Write not allowed.
  dis_init.dis_char_rd_sec = SEC_OPEN;
  err_code = ble_dis_init(&dis_init);
  return ruuvi_nrf5_sdk15_to_ruuvi_error(err_code);
}

/**
 * Start or stop advertising GATT connection.
 *
 * parameter connectable: True to start advertising connectablity false to stop advertising connectablity
 * parameter name: Name of the device to be advertised.
 * parameter company_id: Id of the manufacturer of device
 * parameter advertise_nus: True to enable advertising UUID of NUS in the scan response.
 *
 */
ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_advertise_connectablity(const bool connectable, const char* const name, const uint16_t company_id, const bool advertise_nus)
{
  ret_code_t err_code = NRF_SUCCESS;
  if(!connectable)
  {
    err_code |= sd_ble_gap_adv_stop(m_adv_handle);
    return ruuvi_nrf5_sdk15_to_ruuvi_error(err_code);
  }

// Initialize advertising parameters (used when starting advertising).
  memset(&m_adv_params, 0, sizeof(m_adv_params));
  m_adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
  m_adv_params.duration        = 0;       // Never time out.
  m_adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
  m_adv_params.p_peer_addr     = NULL;    // Undirected advertisement.
  m_adv_params.interval        = MSEC_TO_UNITS(APPLICATION_CONNECTION_ADVERTISEMENT_INTERVAL, UNIT_0_625_MS);

  // OPEN security for name
  ble_gap_conn_sec_mode_t security;
  uint8_t len = strlen(name);
  security.sm = 1;
  security.lv = 1;
  err_code |= sd_ble_gap_device_name_set(&security, (uint8_t*)name, len);

  memset(&m_adv_data, 0, sizeof(m_adv_data));
  memset(&m_advertisement, 0, sizeof(m_advertisement));
  memset(&m_scanresp, 0, sizeof(m_scanresp));
  ble_advdata_t advdata = {0};
  // Only valid flag
  advdata.flags     = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
  // Name will be read from the above GAP data
  advdata.name_type = BLE_ADVDATA_FULL_NAME;
  ble_advdata_manuf_data_t manufacturer_data;
  manufacturer_data.company_identifier = company_id;
  manufacturer_data.data.size = 0;
  manufacturer_data.data.p_data = NULL;

  advdata.p_manuf_specific_data = &manufacturer_data;
  // Encode data
  m_adv_data.adv_data.len = sizeof(m_advertisement);
  err_code |= ble_advdata_encode(&advdata, m_advertisement, &m_adv_data.adv_data.len);
  m_adv_data.adv_data.p_data = m_advertisement;

  // Add scan response if requested
  if(advertise_nus)
  {
    ble_advdata_t scanrsp = {0};
    scanrsp.uuids_complete.uuid_cnt = 1;
    scanrsp.uuids_complete.p_uuids = &(m_adv_uuids[0]);
    // Encode data
    m_adv_data.scan_rsp_data.len = sizeof(m_scanresp);
    err_code |= ble_advdata_encode(&scanrsp, m_scanresp, &m_adv_data.scan_rsp_data.len);
    m_adv_data.scan_rsp_data.p_data = m_scanresp;
  }

  // Configure advertisement and start
  err_code |= sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
  err_code |= sd_ble_gap_adv_start(m_adv_handle, RUUVI_NRF5_SDK15_BLE4_STACK_CONN_TAG);

  return ruuvi_nrf5_sdk15_to_ruuvi_error(err_code);
}

#endif